tutorials/Example_Applications/Fracture/fracture/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 1
);

regions
(
    boxToCell
    {
        box (0 1.85e-4 0) (2e-5 3.4e-4 1);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 0
        );
    }

    boxToCell
    {
        box (0 0 0) (1e-5 1 1);
        fieldValues
        (
            volScalarFieldValue eps 0.999
        );
    }

     boxToCell
    {
        box (0 0 0) (0.5e-5 1 1);
        fieldValues
        (
            volScalarFieldValue alpha.wetting 0
        );
    }



);


// ************************************************************************* //
